<?php
return [

    /*
    |--------------------------------------------------------------------------
    | Global Validation
    |--------------------------------------------------------------------------
    */

    'created_by' => [
        'required' => 'حقل منشئ السجل مطلوب.',
        'integer'  => 'يجب أن يكون منشئ السجل رقمًا صحيحًا.',
        'exists'   => 'المستخدم المحدد كمنشئ غير موجود.',
    ],

    'updated_by' => [
        'required' => 'حقل مُحدث السجل مطلوب.',
        'integer'  => 'يجب أن يكون مُحدث السجل رقمًا صحيحًا.',
        'exists'   => 'المستخدم المحدد كمُحدث غير موجود.',
    ],

    'is_active' => [
        'in' => 'يجب أن تكون قيمة حالة التفعيل 0 أو 1.',
    ],

    "exception_error" => "حدث خطا ما .",
    "invalid_data" => "محاولة ادخال بيانات غير مناسبة.",


    /*
    |--------------------------------------------------------------------------
    | Login Validation
    |--------------------------------------------------------------------------
    */

    'password' => [
        'required' => 'الرمز السري مطلوب.',
    ],

    /*
    |--------------------------------------------------------------------------
    | Login Messages
    |--------------------------------------------------------------------------
    */

    'invalid_credentials'   => 'البريد الالكتروني او الرمز السري غير صحيح.',
    'logged_in'   => 'اهلا وسهلا.',
    'logged_out'   => 'مع السلامة.',
    'token_available'   => 'رمز الجلسة متاح.',

    /*
    |--------------------------------------------------------------------------
    | Pages Validation
    |--------------------------------------------------------------------------
    */

    'slug' => [
        'required' => 'حقل الرابط التعريفي مطلوب.',
        'string' => 'يجب أن يكون الرابط التعريفي نصاً صالحاً.',
        'max' => 'يجب ألا يزيد الرابط التعريفي عن 255 حرفاً.',
        'unique' => 'الرابط التعريفي مستخدم مسبقاً.',
    ],

    'meta_title' => [
        'array' => 'يجب أن يكون عنوان الميتا عبارة عن مصفوفة.',
    ],

    'meta_description' => [
        'array' => 'يجب أن يكون وصف الميتا عبارة عن مصفوفة.',
    ],

    'page_code' => [
        'required' => 'رمز الصفحة مطلوب.',
        'unique'     => 'هذا الرمز موجود بالفعل.',
        'string'   => 'الرمز يجب ان يكون نص صالح.',
        'max'      => 'الرمز يجب ان لا يتجاوز ال 50 حرف.',
    ],



    /*
    |--------------------------------------------------------------------------
    | Pages Messages
    |--------------------------------------------------------------------------
    */

    'get_pages_list'   => 'تم ارجاع قائمة الصفحات بنجاح.',
    'page_not_found'   => 'هذه الصفحة غير موجودة.',
    'get_page_details' => 'تم ارجاع بيانات الصفحة بنجاح.',

    'add_new_page'     => 'تم اضافة الصفحة بنجاح.',
    'update_page'      => 'تم تحديث الصفحة بنجاح.',
    'delete_page'      => 'تم حذف الصفحة بنجاح.',


    /*
    |--------------------------------------------------------------------------
    | Sections Validation
    |--------------------------------------------------------------------------
    */

    'page_id' => [
        'required' => 'حقل معرف الصفحة مطلوب.',
        'integer'  => 'يجب أن يكون معرف الصفحة رقمًا صحيحًا.',
        'exists'   => 'الصفحة المحددة غير موجودة.',
    ],

    'type' => [
        'required' => 'نوع القسم مطلوب.',
        'string'   => 'يجب أن يكون نوع القسم نصًا صالحًا.',
        'max'      => 'يجب ألا يزيد نوع القسم عن 100 حرف.',
    ],

    'title' => [
        'required' => 'حقل العنوان مطلوب.',
        'array' => 'يجب أن يكون العنوان عبارة عن مصفوفة.',
    ],

    'description' => [
        'array' => 'يجب أن يكون الوصف عبارة عن مصفوفة.',
    ],

    'media' => [
        'file'  => 'يجب أن يكون الملف المرفوع صالحًا.',
        'mimes' => 'يجب أن يكون الملف من نوع: jpg أو jpeg أو png أو webp أو mp4.',
        'max'   => 'يجب ألا يتجاوز حجم الملف 10 ميجابايت.',
    ],

    'settings' => [
        'array' => 'يجب أن تكون الإعدادات عبارة عن مصفوفة.',
    ],

    'sort_order' => [
        'integer' => 'يجب أن يكون ترتيب العرض رقمًا صحيحًا.',
        'min'     => 'يجب أن تكون قيمة ترتيب العرض أكبر من أو تساوي 0.',
        'unique'     => 'تم اسناد هذا الترتيب لقسم اخر بالفعل.',
    ],

    'section_code' => [
        'required' => 'رمز القسم مطلوب.',
        'unique'     => 'هذا الرمز موجود بالفعل.',
        'string'   => 'الرمز يجب ان يكون نص صالح.',
        'max'      => 'الرمز يجب ان لا يتجاوز ال 50 حرف.',
    ],


    /*
    |--------------------------------------------------------------------------
    | Section Messages
    |--------------------------------------------------------------------------
    */

    'get_sections_list' => 'تم جلب قائمة الأقسام بنجاح.',
    'section_not_found' => 'القسم غير موجود.',
    'get_section_details' => 'تم جلب تفاصيل القسم بنجاح.',

    'add_new_section' => 'تم إضافة القسم بنجاح.',
    'update_section' => 'تم تحديث القسم بنجاح.',
    'delete_section' => 'تم حذف القسم بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Items Validation
    |--------------------------------------------------------------------------
    */

    'section_id' => [
        'required' => 'حقل معرف القسم مطلوب.',
        'integer'  => 'يجب أن يكون معرف القسم رقمًا صحيحًا.',
        'exists'   => 'القسم المحدد غير موجود.',
    ],

    'link' => [
        'url' => 'يجب أن يكون الرابط رابطًا صالحًا.',
        'max' => 'يجب ألا يزيد الرابط عن 500 حرف.',
    ],

    'extra_data' => [
        'array' => 'يجب أن تكون البيانات الإضافية عبارة عن مصفوفة.',
    ],

    'item_code' => [
        'required' => 'رمز العنصر مطلوب.',
        'unique'     => 'هذا الرمز موجود بالفعل.',
        'string'   => 'الرمز يجب ان يكون نص صالح.',
        'max'      => 'الرمز يجب ان لا يتجاوز ال 50 حرف.',
    ],


    /*
    |--------------------------------------------------------------------------
    | Item Messages
    |--------------------------------------------------------------------------
    */

    'get_items_list' => 'تم جلب قائمة العناصر بنجاح.',
    'item_not_found' => 'العنصر غير موجود.',
    'get_item_details' => 'تم جلب تفاصيل العنصر بنجاح.',

    'add_new_item' => 'تم إضافة العنصر بنجاح.',
    'update_item' => 'تم تحديث العنصر بنجاح.',
    'delete_item' => 'تم حذف العنصر بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Blogs Validation
    |--------------------------------------------------------------------------
    */

    'excerpt' => [
        'array' => 'يجب أن يكون الملخص عبارة عن مصفوفة.',
    ],

    'content' => [
        'required' => 'حقل المحتوى مطلوب.',
        'array'    => 'يجب أن يكون المحتوى عبارة عن مصفوفة.',
    ],

    'seo' => [
        'array' => 'يجب أن تكون بيانات SEO عبارة عن مصفوفة.',
    ],

    'is_published' => [
        'in' => 'يجب أن تكون حالة النشر 0 أو 1.',
    ],

    'published_at' => [
        'date' => 'يجب أن يكون تاريخ النشر تاريخًا صالحًا.',
    ],

    /*
    |--------------------------------------------------------------------------
    | Blog Messages
    |--------------------------------------------------------------------------
    */

    'get_blogs_list' => 'تم جلب قائمة المقالات بنجاح.',
    'blog_not_found' => 'المقال غير موجود.',
    'get_blog_details' => 'تم جلب تفاصيل المقال بنجاح.',

    'add_new_blog' => 'تم إضافة المقال بنجاح.',
    'update_blog' => 'تم تحديث المقال بنجاح.',
    'delete_blog' => 'تم حذف المقال بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Careers Validation
    |--------------------------------------------------------------------------
    */

    'requirements' => [
        'array' => 'يجب أن تكون المتطلبات عبارة عن مصفوفة.',
    ],

    'location' => [
        'string' => 'يجب أن يكون الموقع نصًا صالحًا.',
        'max'    => 'يجب ألا يزيد الموقع عن 255 حرفًا.',
    ],

    'employment_type' => [
        'string' => 'يجب أن يكون نوع التوظيف نصًا صالحًا.',
        'max'    => 'يجب ألا يزيد نوع التوظيف عن 100 حرف.',
    ],

    'deadline' => [
        'date' => 'يجب أن يكون الموعد النهائي تاريخًا صالحًا.',
    ],

    /*
    |--------------------------------------------------------------------------
    | Career Messages
    |--------------------------------------------------------------------------
    */

    'get_careers_list' => 'تم جلب قائمة الوظائف بنجاح.',
    'career_not_found' => 'الوظيفة غير موجودة.',
    'get_career_details' => 'تم جلب تفاصيل الوظيفة بنجاح.',

    'add_new_career' => 'تم إضافة الوظيفة بنجاح.',
    'update_career' => 'تم تحديث الوظيفة بنجاح.',
    'delete_career' => 'تم حذف الوظيفة بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Career Application Messages
    |--------------------------------------------------------------------------
    */

    'get_career_applications_list' => 'تم استرجاع قائمة طلبات التوظيف بنجاح.',
    'career_application_not_found' => 'طلب التوظيف غير موجود.',
    'get_career_application_details' => 'تم استرجاع تفاصيل طلب التوظيف بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Career Application Messages
    |--------------------------------------------------------------------------
    */

    'get_contact_messages_list' => 'تم استرجاع قائمة الرسائل بنجاح.',
    'contact_message_not_found' => 'الرسالة غير موجودة.',
    'get_contact_message_details' => 'تم استرجاع تفاصيل الرسالة بنجاح.',

    /*
    |--------------------------------------------------------------------------
    | Settings Validation
    |--------------------------------------------------------------------------
    */

    'key' => [
        'required' => 'حقل المفتاح مطلوب.',
        'string'   => 'يجب أن يكون المفتاح نصًا صالحًا.',
        'max'      => 'يجب ألا يزيد المفتاح عن 255 حرفًا.',
        'unique'   => 'هذا المفتاح مستخدم مسبقًا.',
    ],

    'value' => [
        'array' => 'يجب أن تكون القيمة عبارة عن مصفوفة.',
    ],

    /*
    |--------------------------------------------------------------------------
    | Settings Messages
    |--------------------------------------------------------------------------
    */

    'get_settings_list' => 'تم جلب قائمة الإعدادات بنجاح.',
    'setting_not_found' => 'الإعداد غير موجود.',
    'get_setting_details' => 'تم جلب تفاصيل الإعداد بنجاح.',

    'add_new_setting' => 'تم إضافة الإعداد بنجاح.',
    'update_setting' => 'تم تحديث الإعداد بنجاح.',
    'delete_setting' => 'تم حذف الإعداد بنجاح.',



    /*
    |--------------------------------------------------------------------------
    | Website Messages
    |--------------------------------------------------------------------------
    */

    'home_page' => 'تم جلب الصفحات بنجاح.',
    'blog_page' => 'تم جلب المدونات بنجاح.',
    'career_page' => 'تم جلب الوظائف بنجاح.',
    'apply_job' => 'تم تقديم طلبك بنجاح.',
    'contact_us' => 'شكرا لتواصلك معنا تم استلام رسالتك.',


    /*
    |--------------------------------------------------------------------------
    | Website Validation
    |--------------------------------------------------------------------------
    */

    'career_id' => [
        'required' => 'الوظيفة مطلوبة.',
        'integer'  => 'اختيار الوظيفة غير صالح.',
        'exists'   => 'الوظيفة المختارة غير موجودة.',
    ],

    'full_name' => [
        'required' => 'الاسم الكامل مطلوب.',
        'string'   => 'الاسم يجب أن يكون نصاً صالحاً.',
        'max'      => 'الاسم لا يجب أن يتجاوز 255 حرف.',
    ],

    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email'    => 'يرجى إدخال بريد إلكتروني صحيح.',
        'max'      => 'البريد الإلكتروني لا يجب أن يتجاوز 255 حرف.',
        'exists'   => 'البريد الالكتروني المدخل غير موجود.',
    ],

    'phone' => [
        'string' => 'رقم الهاتف يجب أن يكون نصاً صالحاً.',
        'max'    => 'رقم الهاتف لا يجب أن يتجاوز 100 حرف.',
    ],

    'cv_file' => [
        'required' => 'ملف السيرة الذاتية مطلوب.',
        'file'     => 'الملف المرفوع غير صالح.',
        'mimes'    => 'السيرة الذاتية يجب أن تكون بصيغة PDF أو DOC أو DOCX.',
        'max'      => 'حجم الملف يجب ألا يتجاوز 10 ميجابايت.',
    ],

    'message' => [
        'string' => 'الرسالة يجب أن تكون نصاً صالحاً.',
        'max'    => 'الرسالة لا يجب أن تتجاوز 5000 حرف.',
    ],

    'subject' => [
        'string' => 'الموضوع يجب أن يكون نصاً صالحاً.',
        'max'    => 'الموضوع لا يجب أن يتجاوز 255 حرف.',
    ],


];
